{
  "navigation": {
    "links": {
      "home": "home",
      "about": "about",
      "skills": "skills",
      "services": "services",
      "projects": "projects",
      "contact": "contact"
    },
    "ariaLabels": {
      "changeLanguage": "Change language",
      "changeTheme": "Change theme",
      "toggleMenu": "Open and close menu"
    },
    "altTexts": {
      "languageIcon": "language icon",
      "themeIcon": "theme icon"
    }
  },
  "init": {},
  "about": {
    "title": "About",
    "description1": "My name is <strong className='strong-light'>Jefferson Santos</strong> and I am a technology enthusiast who decided to pursue a career in programming. Over the last <strong className='strong-light'>four years</strong>, I have dedicated myself to understanding the main technologies on the market and applying  <strong className='strong-light'> agile development methodologies</strong> (I&#8217;m a coffee lover).",
    "description2": "I completed a technical course in <strong className='strong-light'> Systems Development (DS)</strong> with a focus on <strong className='strong-light'> Full Stack development</strong>. Since then, I have worked on projects as a freelancer and contributed to open source projects, continually improving my skills and experience in the field."
  },
  "skills": {
    "title": "Skills",
    "defaultText": "* Hover over skills to learn more *",
    "textNodejs": "I chose Node.js because it allows me to create scalable and fast applications that can handle many requests at the same time without losing performance. I enjoy exploring the power of JavaScript on the backend and its frameworks to develop modern, solid solutions that truly make a difference.",
    "textExpress": "Express.js is my go-to framework for creating robust and scalable RESTful APIs, providing a flexible and modular structure to handle requests and responses efficiently.",
    "textNestjs": "I am passionate about learning and mastering Nest.js, a framework that promises to revolutionize the way I develop robust and scalable server-side applications, with a modular architecture and integration with TypeScript.",
    "textReact": "With the powerful React library, I develop dynamic and reactive interfaces, creating fluid and interactive user experiences with JavaScript and TypeScript, always prioritizing performance and scalability.",
    "textNextJs": "With Next.js, I create truly exceptional server-side rendering (SSR) and static site generation (SSG) web applications, ensuring impeccable speed, SEO, and user experience.",
    "textSass": "Sass is my tool of choice for creating more efficient and modular CSS styles, leveraging the ability to use variables, mixins, and functions to create a personalized and responsive user experience.",
    "textFlutter": "Currently, I study and apply Flutter in the development of cross-platform mobile applications, creating personalized interfaces and high-quality, fluid user experiences.",
    "textJava": "Java is my first love; with it, I create 'Topzadas' applications that meet the most complex needs, leveraging the ability to handle large volumes of data and ensure data integrity and availability.",
    "textPostgres": "Postgres is my database of choice, and with Neon, I can efficiently provision and manage serverless databases, ensuring data integrity and availability.",
    "textMySQL": "With MySQL, I store and manage large volumes of data efficiently and scalably, ensuring data integrity and availability.",
    "textGit": "Git and GitHub are my go-to tools for managing code versioning and collaborating with other developers, ensuring code integrity and traceability.",
    "textDocker": "With Docker, I can containerize applications and ensure consistency and portability across different environments, simplifying the development, testing, and deployment process, and ensuring scalability and reliability."
  },
  "project": {
    "title": "Projects",
    "list": [
      {
        "title": "JTec Platform",
        "description": "Web platform focused on centralizing project and team management in a single environment. It allows tracking clients, companies, users, tasks, goals, and system access, providing strategic insight, operational control, and security for decision-making.",
        "stack": "Stack: NextJs | ChartJs | JavaScript | SASS"
      },
      {
        "title": "JTec API",
        "description": "API responsible for supporting the entire business logic of the JTec platform. It manages authentication, permissions, projects, users, tasks, and access logs, following best practices in architecture, documentation, and scalability.",
        "stack": "Stack: NodeJs | Express | Postgres | Docker | Swagger"
      },
      {
        "title": "Léo de Lita Cookies",
        "description": "Institutional website developed to showcase the brand’s products in an attractive way, reinforce its visual identity, and create a digital communication channel with customers and partners.",
        "stack": "Stack: React | SASS | TypeScript | Boxicons"
      },
      {
        "title": "Óticas Leal",
        "description": "Institutional website created to highlight products, services, and the credibility of Óticas Leal, offering simple navigation aligned with the brand identity.",
        "stack": "Stack: React | SASS | JavaScript | Boxicons"
      },
      {
        "title": "Jéssica Spreadsheets",
        "description": "Website focused on presenting customized spreadsheet solutions, emphasizing clarity, professionalism, and conversion of visitors into potential clients.",
        "stack": "Stack: React | SASS | TypeScript | Boxicons"
      },
      {
        "title": "IDE Platform",
        "description": "Web platform developed to centralize and simplify the management of IEADPE evangelization projects. The interface was designed to provide simple, organized, and accessible navigation, supporting church communication and activity tracking.",
        "stack": "Stack: React | JavaScript | SASS | Boxicons"
      },
      {
        "title": "IDE API",
        "description": "API responsible for business logic and data persistence of the IDE Platform. It implements rules, integrations, and data control, using an organized architecture and design patterns to ensure scalability and long-term maintainability.",
        "stack": "Stack: NodeJs | Express | Postgres | Factory"
      },
      {
        "title": "Landing Page – Piano Course",
        "description": "Landing page created to promote piano courses, focusing on clear content presentation, lead generation, and encouraging visitor conversion.",
        "stack": "Stack: React | TypeScript | SASS | Boxicons"
      },
      {
        "title": "Landing Page – React Course",
        "description": "Landing page developed to promote React courses, highlighting benefits, value proposition, and calls to action in a modern and objective way.",
        "stack": "Stack: React | TypeScript | SASS | Boxicons"
      },
      {
        "title": "Landing Page – Recipe Ebook",
        "description": "Landing page focused on promoting and selling recipe ebooks, prioritizing a pleasant visual experience and conversion strategies.",
        "stack": "Stack: React | TypeScript | SASS | Boxicons"
      },
      {
        "title": "Landing Page – Mentorship",
        "description": "Landing page created to present paid traffic mentorship services, with direct communication, persuasive structure, and focus on lead generation.",
        "stack": "Stack: React | TypeScript | SASS | Boxicons"
      },
      {
        "title": "Landing Page – Dentist",
        "description": "Landing page developed to promote dental services, conveying trust, professionalism, and facilitating contact with patients.",
        "stack": "Stack: React | TypeScript | SASS | Boxicons"
      },
      {
        "title": "Sushi Restaurant",
        "description": "Institutional website developed to showcase sushi products, focusing on clear presentation and lead generation.",
        "stack": "Stack: React | TypeScript | SASS | Boxicons"
      }
    ],
    "textButton": "View project"
  },
  "services": {
    "title": "Services",
    "card1": {
      "title": "Website Creation",
      "text": "Creation of personalized websites, whether personal or for various business sectors"
    },
    "card2": {
      "title": "Responsive Websites",
      "text": "All websites are responsive, to further improve the user experience on any device."
    },
    "card3": {
      "title": "API Creation",
      "text": "Creation of secure Rest APIs and integration experience with external databases."
    }
  },
  "contact": {
    "title": "Contact",
    "namePlaceholder": "Enter your first and last name",
    "emailPlaceholder": "Enter your email",
    "subjectPlaceholder": "Subject of the message",
    "messagePlaceholder": "Your message...",
    "sendButton": "Send"
  }
}