{
  "navigation": {
    "links": {
      "home": "inicio",
      "about": "acerca de",
      "skills": "habilidades",
      "services": "servicios",
      "projects": "proyectos",
      "contact": "contacto"
    },
    "ariaLabels": {
      "changeLanguage": "Cambiar idioma",
      "changeTheme": "Cambiar tema",
      "toggleMenu": "Abrir y cerrar menú"
    },
    "altTexts": {
      "languageIcon": "icono de idioma",
      "themeIcon": "icono de tema"
    }
  },
  "init": {
    "text": "Desarrollador web especializado en crear experiencias modernas y eficientes.",
    "textButton": "Ver mi trabajo"
  },
  "about": {
    "title": "Acerca de",
    "description1": "Mi nombre es <strong className='strong-light'>Jefferson Santos</strong> y soy un entusiasta de la tecnología que decidió seguir una carrera en programación. Durante los últimos <strong className='strong-light'>cuatro años</strong>, me he dedicado a comprender las principales tecnologías del mercado y a aplicar <strong className='strong-light'>metodologías de desarrollo ágiles</strong> (soy unamante del café).",
    "description2": "Completé un curso técnico en <strong className='strong-light'> Desarrollo de Sistemas (DS)</strong> con un enfoque en <strong className='strong-light'> desarrollo Full Stack</strong>. Desde entonces, he trabajado en proyectos como freelancer y he contribuido a proyectos de código abierto, mejorando continuamente mis habilidades y experiencia en el campo."
  },
  "skills": {
    "title": "Habilidades",
    "defaultText": "* Pasa el cursor sobre las habilidades para saber más *",
    "textNodejs": "Elegí Node.js porque me permite crear aplicaciones escalables y rápidas, que aguantan muchas peticiones al mismo tiempo sin perder rendimiento. Me gusta explorar el poder de JavaScript en el backend y sus frameworks para desarrollar soluciones modernas, sólidas y que realmente marcan la diferencia.",
    "textExpress": "Express.js es mi framework de elección para crear APIs RESTful robustas y escalables, proporcionando una estructura flexible y modular para manejar peticiones y respuestas de forma eficiente.",
    "textNestjs": "Estoy apasionado por aprender y dominar Nest.js, un framework que promete revolucionar la forma en que desarrollo aplicaciones server-side robustas y escalables, con una arquitectura modular e integración con TypeScript.",
    "textReact": "Con la poderosa biblioteca React, desarrollo interfaces dinámicas y reactivas, creando experiencias de usuario fluidas e interactivas con JavaScript y TypeScript, siempre priorizando el rendimiento y la escalabilidad.",
    "textNextJs": "Con Next.js, creo aplicaciones web de renderizado del lado del servidor (SSR) y generación de sitios estáticos (SSG) que son verdaderamente excepcionales, garantizando velocidad, SEO y una experiencia de usuario impecable.",
    "textSass": "Sass es mi herramienta de elección para crear estilos CSS más eficientes y modulares, aprovechando la capacidad de usar variables, mixins y funciones para crear una experiencia de usuario personalizada y receptiva.",
    "textFlutter": "Actualmente, estudio y aplico Flutter en el desarrollo de aplicaciones móviles multiplataforma, creando interfaces personalizadas y experiencias de usuario fluidas y de alta calidad.",
    "textJava": "Java es mi primer amor, con él creo aplicaciones 'Topzadas' que satisfacen las necesidades más complejas, aprovechando la capacidad de manejar grandes volúmenes de datos y garantizar la integridad y disponibilidad de los datos.",
    "textPostgres": "Postgres es mi base de datos de elección, y con Neon, puedo aprovisionar y gestionar bases de datos sin servidor de forma eficiente, garantizando la integridad y disponibilidad de los datos.",
    "textMySQL": "Con MySQL, almaceno y gestiono grandes volúmenes de datos de forma eficiente y escalable, garantizando la integridad y disponibilidad de los datos.",
    "textGit": "Git y GitHub son mis herramientas de elección para gestionar el versionado de código y colaborar con otros desarrolladores, garantizando la integridad y trazabilidad del código.",
    "textDocker": "Con Docker, puedo contenerizar aplicaciones y garantizar la consistencia y portabilidad en diferentes entornos, simplificando el proceso de desarrollo, prueba y despliegue, y garantizando la escalabilidad y confiabilidad."
  },
  "project": {
    "title": "Proyectos",
    "list": [
      {
        "title": "Plataforma JTec",
        "description": "Plataforma web enfocada en centralizar la gestión de proyectos y equipos en un solo entorno. Permite el seguimiento de clientes, empresas, usuarios, tareas, metas y accesos al sistema, ofreciendo visión estratégica, control operativo y seguridad para la toma de decisiones.",
        "stack": "Stack: NextJs | ChartJs | JavaScript | SASS"
      },
      {
        "title": "JTec API",
        "description": "API responsable de soportar toda la lógica de negocio de la plataforma JTec. Gestiona autenticación, permisos, proyectos, usuarios, tareas y registros de acceso, siguiendo buenas prácticas de arquitectura, documentación y escalabilidad.",
        "stack": "Stack: NodeJs | Express | Postgres | Docker | Swagger"
      },
      {
        "title": "Galletas Léo de Lita",
        "description": "Sitio web institucional desarrollado para presentar los productos de la marca de forma atractiva, reforzar su identidad visual y crear un canal digital de comunicación con clientes y socios.",
        "stack": "Stack: React | SASS | TypeScript | Boxicons"
      },
      {
        "title": "Óticas Leal",
        "description": "Sitio web institucional creado para destacar productos, servicios y la credibilidad de Óticas Leal, proporcionando una navegación sencilla y alineada con la identidad de la marca.",
        "stack": "Stack: React | SASS | JavaScript | Boxicons"
      },
      {
        "title": "Jéssica Hojas de Cálculo",
        "description": "Sitio web orientado a la presentación de soluciones en hojas de cálculo personalizadas, con enfoque en claridad, profesionalismo y conversión de visitantes en clientes potenciales.",
        "stack": "Stack: React | SASS | TypeScript | Boxicons"
      },
      {
        "title": "Plataforma IDE",
        "description": "Plataforma web desarrollada para centralizar y facilitar la gestión de proyectos de evangelización de la IEADPE. La interfaz fue diseñada para ofrecer una navegación simple, organizada y accesible.",
        "stack": "Stack: React | JavaScript | SASS | Boxicons"
      },
      {
        "title": "IDE API",
        "description": "API responsable de la lógica de negocio y la persistencia de datos de la Plataforma IDE. Implementa reglas, integraciones y control de información, utilizando una arquitectura organizada y patrones de diseño.",
        "stack": "Stack: NodeJs | Express | Postgres | Factory"
      },
      {
        "title": "Landing Page – Curso de Piano",
        "description": "Landing page creada para promocionar cursos de piano, enfocada en la presentación clara del contenido, captación de leads y conversión de visitantes.",
        "stack": "Stack: React | TypeScript | SASS | Boxicons"
      },
      {
        "title": "Landing Page – Curso de React",
        "description": "Landing page desarrollada para promocionar cursos de React, destacando beneficios, propuesta de valor y llamadas a la acción de forma moderna y objetiva.",
        "stack": "Stack: React | TypeScript | SASS | Boxicons"
      },
      {
        "title": "Landing Page – Ebook de Recetas",
        "description": "Landing page enfocada en la promoción y venta de ebooks de recetas, priorizando una experiencia visual agradable y estrategias de conversión.",
        "stack": "Stack: React | TypeScript | SASS | Boxicons"
      },
      {
        "title": "Landing Page – Mentoría",
        "description": "Landing page creada para presentar servicios de mentoría en tráfico pago, con comunicación directa, estructura persuasiva y enfoque en la generación de contactos.",
        "stack": "Stack: React | TypeScript | SASS | Boxicons"
      },
      {
        "title": "Landing Page – Dentista",
        "description": "Landing page desarrollada para la promoción de servicios odontológicos, transmitiendo confianza, profesionalismo y facilitando el contacto con pacientes.",
        "stack": "Stack: React | TypeScript | SASS | Boxicons"
      },
      {
        "title": "Tienda de Sushi",
        "description": "Sitio web institucional desarrollado para promocionar productos de sushi, con enfoque en una presentación clara y captación de leads.",
        "stack": "Stack: React | TypeScript | SASS | Boxicons"
      },
      {
        "title": "Portafolio Personal",
        "description": "Mi portafolio personal, donde presento proyectos, experiencias y habilidades desarrolladas a lo largo de mi carrera como desarrollador web.",
        "stack": "Stack: React | TypeScript | SASS | Boxicons"
      }
    ],
    "textButton": "Ver proyecto"
  },
  "services": {
    "title": "Servicios",
    "card1": {
      "title": "Creación de Sitios Web",
      "text": "Creación de sitios web personalizados, ya sean personales o para diversos sectores de negocio."
    },
    "card2": {
      "title": "Sitios Web Adaptables",
      "text": "Todos los sitios web son adaptables, para mejorar aún más la experiencia del usuario en cualquier dispositivo."
    },
    "card3": {
      "title": "Creación de APIs",
      "text": "Creación de APIs Rest seguras y experiencia en integración con bases de datos externas."
    }
  },
  "contact": {
    "title": "Contacto",
    "namePlaceholder": "Ingresa tu nombre y apellido",
    "emailPlaceholder": "Ingresa tu correo electrónico",
    "subjectPlaceholder": "Asunto del mensaje",
    "messagePlaceholder": "Tu mensaje...",
    "sendButton": "Enviar"
  },
  "messages": {
    "here": "¡Es aquí mismo! 😎",
    "repositoryNot": "¡Este repositorio no está disponible (por ahora)!",
    "deployNot": "¡Este deploy no está disponible (por ahora)!",
    "see_in": "Ver en:",
    "tech": "Stack:",
    "lib": "Librerías:",
    "infra": "Infraestructura:"
  }
}