{
  "navigation": {
    "links": {
      "home": "à ccueil",
      "about": "à propos",
      "skills": "compétences",
      "services": "services",
      "projects": "projets",
      "contact": "contact"
    },
    "ariaLabels": {
      "changeLanguage": "Changer de langue",
      "changeTheme": "Changer de thème",
      "toggleMenu": "Ouvrir et fermer le menu"
    },
    "altTexts": {
      "languageIcon": "icône de la langue",
      "themeIcon": "icône du thème"
    }
  },
  "init": {},
  "about": {
    "title": "À propos",
    "description1": "Je m'appelle <strong className='strong-light'>Jefferson Santos</strong> et je suis un passionné de technologie qui a décidé de faire carrière dans la programmation. Au cours des <strong className='strong-light'>quatre dernières années</strong>, je me suis consacré à la compréhension des principales technologies du marché et à l'application de <strong className='strong-light'>méthodologies de développement agiles</strong> (je suis un amateur de café).",
    "description2": "J'ai terminé un cours technique en <strong className='strong-light'> Développement de Systèmes (DS)</strong> axé sur le <strong className='strong-light'> développement Full Stack</strong>. Depuis, j'ai travaillé sur des projets en tant que freelance et j'ai contribué à des projets open source, améliorant continuellement mes compétences et mon expérience dans le domaine."
  },
  "skills": {
    "title": "Compétences",
    "defaultText": "* Survolez les compétences pour en savoir plus *",
    "textNodejs": "J'ai choisi Node.js car il me permet de créer des applications évolutives et rapides, qui peuvent gérer de nombreuses requêtes en même temps sans perdre de performance. J'aime explorer la puissance de JavaScript dans le backend et ses frameworks pour développer des solutions modernes, solides et qui font vraiment la différence.",
    "textExpress": "Express.js est mon framework de prédilection pour créer des API RESTful robustes et évolutives, offrant une structure flexible et modulaire pour gérer les requêtes et les réponses de manière efficace.",
    "textNestjs": "Je suis passionné par l'apprentissage et la maîtrise de Nest.js, un framework qui promet de révolutionner la façon dont je développe des applications côté serveur robustes et évolutives, avec une architecture modulaire et une intégration avec TypeScript.",
    "textReact": "Avec la puissante bibliothèque React, je développe des interfaces dynamiques et réactives, créant des expériences utilisateur fluides et interactives avec JavaScript et TypeScript, en priorisant toujours la performance et l'évolutivité.",
    "textNextJs": "Avec Next.js, je crée des applications web de rendu côté serveur (SSR) et de génération de sites statiques (SSG) qui sont vraiment exceptionnelles, garantissant une vitesse, un référencement et une expérience utilisateur impeccables.",
    "textSass": "Sass est mon outil de choix pour créer des styles CSS plus efficaces et modulaires, en tirant parti de la possibilité d'utiliser des variables, des mixins et des fonctions pour créer une expérience utilisateur personnalisée et réactive.",
    "textFlutter": "Actuellement, j'étudie et j'applique Flutter dans le développement d'applications mobiles multiplateformes, créant des interfaces personnalisées et des expériences utilisateur fluides et de haute qualité.",
    "textJava": "Java est mon premier amour; avec lui, je crée des applications 'Topzadas' qui répondent aux besoins les plus complexes, en tirant parti de la capacité à gérer de grands volumes de données et à garantir l'intégrité et la disponibilité des données.",
    "textPostgres": "Postgres est ma base de données de prédilection, et avec Neon, je peux provisionner et gérer des bases de données sans serveur de manière efficace, garantissant l'intégrité et la disponibilité des données.",
    "textMySQL": "Avec MySQL, je stocke et gère de grands volumes de données de manière efficace et évolutive, garantissant l'intégrité et la disponibilité des données.",
    "textGit": "Git et GitHub sont mes outils de choix pour gérer le versionnement du code et collaborer avec d'autres développeurs, garantissant l'intégrité et la traçabilité du code.",
    "textDocker": "Avec Docker, je peux conteneuriser des applications et garantir la cohérence et la portabilité dans différents environnements, simplifiant le processus de développement, de test et de déploiement, et garantissant l'évolutivité et la fiabilité."
  },
  "project": {
    "title": "Projets",
    "list": [
      {
        "title": "Plateforme JTec",
        "description": "Plateforme web dédiée à la centralisation de la gestion des projets et des équipes dans un environnement unique. Elle permet de suivre les clients, entreprises, utilisateurs, tâches, objectifs et accès au système, offrant une vision stratégique et un contrôle opérationnel sécurisé.",
        "stack": "Stack: NextJs | ChartJs | JavaScript | SASS"
      },
      {
        "title": "JTec API",
        "description": "API responsable de toute la logique métier de la plateforme JTec. Elle gère l’authentification, les permissions, les projets, les utilisateurs, les tâches et les journaux d’accès, en respectant les bonnes pratiques d’architecture et de scalabilité.",
        "stack": "Stack: NodeJs | Express | Postgres | Docker | Swagger"
      },
      {
        "title": "Biscuits Léo de Lita",
        "description": "Site institutionnel développé pour présenter les produits de la marque de manière attractive, renforcer son identité visuelle et établir un canal de communication numérique.",
        "stack": "Stack: React | SASS | TypeScript | Boxicons"
      },
      {
        "title": "Óticas Leal",
        "description": "Site institutionnel conçu pour mettre en valeur les produits, services et la crédibilité d’Óticas Leal, avec une navigation simple et cohérente avec l’identité de la marque.",
        "stack": "Stack: React | SASS | JavaScript | Boxicons"
      },
      {
        "title": "Jéssica Tableurs",
        "description": "Site web dédié à la présentation de solutions de tableurs personnalisés, axé sur la clarté, le professionnalisme et la conversion des visiteurs en clients potentiels.",
        "stack": "Stack: React | SASS | TypeScript | Boxicons"
      },
      {
        "title": "Plateforme IDE",
        "description": "Plateforme web développée pour centraliser et simplifier la gestion des projets d’évangélisation de l’IEADPE, avec une interface claire, organisée et accessible.",
        "stack": "Stack: React | JavaScript | SASS | Boxicons"
      },
      {
        "title": "IDE API",
        "description": "API responsable de la logique métier et de la persistance des données de la plateforme IDE, utilisant une architecture structurée et des design patterns pour assurer la maintenabilité.",
        "stack": "Stack: NodeJs | Express | Postgres | Factory"
      },
      {
        "title": "Landing Page – Cours de Piano",
        "description": "Landing page conçue pour promouvoir des cours de piano, avec un contenu clair, une génération de leads efficace et un fort potentiel de conversion.",
        "stack": "Stack: React | TypeScript | SASS | Boxicons"
      },
      {
        "title": "Landing Page – Cours de React",
        "description": "Landing page développée pour promouvoir des cours de React, mettant en avant les avantages, la proposition de valeur et les appels à l’action.",
        "stack": "Stack: React | TypeScript | SASS | Boxicons"
      },
      {
        "title": "Landing Page – Ebook de Recettes",
        "description": "Landing page dédiée à la promotion et à la vente d’ebooks de recettes, avec une expérience visuelle agréable et des stratégies de conversion.",
        "stack": "Stack: React | TypeScript | SASS | Boxicons"
      },
      {
        "title": "Landing Page – Mentorat",
        "description": "Landing page conçue pour présenter des services de mentorat en trafic payant, avec une communication directe et une structure persuasive.",
        "stack": "Stack: React | TypeScript | SASS | Boxicons"
      },
      {
        "title": "Landing Page – Dentiste",
        "description": "Landing page développée pour promouvoir des services dentaires, transmettant confiance, professionnalisme et facilitant la prise de contact.",
        "stack": "Stack: React | TypeScript | SASS | Boxicons"
      },
      {
        "title": "Boutique de Sushi",
        "description": "Site institutionnel développé pour présenter des produits de sushi, avec un accent sur une présentation claire et la génération de leads.",
        "stack": "Stack: React | TypeScript | SASS | Boxicons"
      },
      {
        "title": "Portfolio Personnel",
        "description": "Mon portfolio personnel où je présente mes projets, expériences et compétences développées au cours de ma carrière de développeur web.",
        "stack": "Stack: React | TypeScript | SASS | Boxicons"
      }
    ],
    "textButton": "Voir le projet"
  },
  "services": {
    "title": "Services",
    "card1": {
      "title": "Création de Sites Web",
      "text": "Création de sites web personnalisés, qu'ils soient personnels ou pour divers secteurs d'activité."
    },
    "card2": {
      "title": "Sites Web Adaptatifs",
      "text": "Tous les sites web sont adaptatifs, pour améliorer encore l'expérience utilisateur sur n'importe quel appareil."
    },
    "card3": {
      "title": "Création d'APIs",
      "text": "Création d'APIs Rest sécurisées et expérience d'intégration avec des bases de données externes."
    }
  },
  "contact": {
    "title": "Contact",
    "namePlaceholder": "Entrez votre prénom et nom de famille",
    "emailPlaceholder": "Entrez votre e-mail",
    "subjectPlaceholder": "Objet du message",
    "messagePlaceholder": "Votre message...",
    "sendButton": "Envoyer"
  },
  "messages": {
    "here": "C’est bien ici ! 😎",
    "repositoryNot": "Ce dépôt n’est pas disponible (pour le moment) !",
    "deployNot": "Ce déploiement n’est pas disponible (pour le moment) !",
    "see_in": "Voir sur :",
    "tech": "Stack :",
    "lib": "Librairies :",
    "infra": "Infrastructure :"
  }
}