{
  "navigation": {
    "links": {
      "home": "home",
      "about": "chi sono",
      "skills": "competenze",
      "services": "servizi",
      "projects": "progetti",
      "contact": "contatti"
    },
    "ariaLabels": {
      "changeLanguage": "Cambia lingua",
      "changeTheme": "Cambia tema",
      "toggleMenu": "Apri e chiudi il menu"
    },
    "altTexts": {
      "languageIcon": "icona della lingua",
      "themeIcon": "icona del tema"
    }
  },
  "init": {},
  "about": {
    "title": "Chi sono",
    "description1": "Mi chiamo <strong className='strong-light'>Jefferson Santos</strong> e sono un appassionato di tecnologia che ha deciso di intraprendere una carriera nella programmazione. Negli ultimi <strong className='strong-light'>quattro anni</strong>, mi sono dedicato a comprendere le principali tecnologie sul mercato e ad applicare <strong className='strong-light'>metodologie di sviluppo agili</strong> (sono un amante del caffè).",
    "description2": "Ho completato un corso tecnico in <strong className='strong-light'> Sviluppo di Sistemi (DS)</strong> con un focus sullo <strong className='strong-light'> sviluppo Full Stack</strong>. Da allora, ho lavorato su progetti come freelance e ho contribuito a progetti open source, migliorando continuamente le mie competenze ed esperienza nel settore."
  },
  "skills": {
    "title": "Competenze",
    "defaultText": "* Passa il mouse sulle competenze per saperne di più *",
    "textNodejs": "Ho scelto Node.js perché mi permette di creare applicazioni scalabili e veloci, che gestiscono molte richieste contemporaneamente senza perdere prestazioni. Mi piace esplorare il potere di JavaScript nel backend e i suoi framework per sviluppare soluzioni moderne, solide e che fanno davvero la differenza.",
    "textExpress": "Express.js è il mio framework di elezione per creare API RESTful robuste e scalabili, fornendo una struttura flessibile e modulare per gestire richieste e risposte in modo efficiente.",
    "textNestjs": "Sono appassionato di imparare e padroneggiare Nest.js, un framework che promette di rivoluzionare il modo in cui sviluppo applicazioni server-side robuste e scalabili, con un'architettura modulare e l'integrazione con TypeScript.",
    "textReact": "Con la potente libreria React, sviluppo interfacce dinamiche e reattive, creando esperienze utente fluide e interattive con JavaScript e TypeScript, dando sempre priorità alle prestazioni e alla scalabilità.",
    "textNextJs": "Con Next.js, creo applicazioni web con rendering lato server (SSR) e generazione di siti statici (SSG) che sono veramente eccezionali, garantendo velocità, SEO e un'esperienza utente impeccabile.",
    "textSass": "Sass è il mio strumento di scelta per creare stili CSS più efficienti e modulari, sfruttando la capacità di usare variabili, mixin e funzioni per creare un'esperienza utente personalizzata e reattiva.",
    "textFlutter": "Attualmente, studio e applico Flutter nello sviluppo di applicazioni mobili multipiattaforma, creando interfacce personalizzate ed esperienze utente fluide e di alta qualità.",
    "textJava": "Java è il mio primo amore; con esso, creo applicazioni 'Topzadas' che soddisfano le esigenze più complesse, sfruttando la capacità di gestire grandi volumi di dati e garantire l'integrità e la disponibilità dei dati.",
    "textPostgres": "Postgres è il mio database di elezione, e con Neon, posso fornire e gestire database serverless in modo efficiente, garantendo l'integrità e la disponibilità dei dati.",
    "textMySQL": "Con MySQL, archivio e gestisco grandi volumi di dati in modo efficiente e scalabile, garantendo l'integrità e la disponibilità dei dati.",
    "textGit": "Git e GitHub sono i miei strumenti di scelta per gestire il versioning del codice e collaborare con altri sviluppatori, garantendo l'integrità e la tracciabilità del codice.",
    "textDocker": "Con Docker, posso containerizzare applicazioni e garantire la coerenza e la portabilità in diversi ambienti, semplificando il processo di sviluppo, test e distribuzione, e garantendo la scalabilità e l'affidabilità."
  },
  "project": {
    "title": "Progetti",
    "list": [
    {
      "title": "Piattaforma JTec",
      "description": "Piattaforma web focalizzata sulla centralizzazione della gestione di progetti e team in un unico ambiente. Consente di monitorare clienti, aziende, utenti, attività, obiettivi e accessi al sistema, offrendo controllo operativo e visione strategica.",
      "stack": "Stack: NextJs | ChartJs | JavaScript | SASS"
    },
    {
      "title": "JTec API",
      "description": "API responsabile dell’intera logica di business della piattaforma JTec. Gestisce autenticazione, permessi, progetti, utenti, attività e registri di accesso, seguendo le migliori pratiche di architettura e scalabilità.",
      "stack": "Stack: NodeJs | Express | Postgres | Docker | Swagger"
    },
    {
      "title": "Biscotti Léo de Lita",
      "description": "Sito istituzionale sviluppato per presentare i prodotti del brand in modo accattivante, rafforzare l’identità visiva e creare un canale digitale di comunicazione.",
      "stack": "Stack: React | SASS | TypeScript | Boxicons"
    },
    {
      "title": "Óticas Leal",
      "description": "Sito istituzionale creato per valorizzare prodotti, servizi e l’affidabilità di Óticas Leal, offrendo una navigazione semplice e coerente con il brand.",
      "stack": "Stack: React | SASS | JavaScript | Boxicons"
    },
    {
      "title": "Jéssica Fogli di Calcolo",
      "description": "Sito web dedicato alla presentazione di soluzioni personalizzate in fogli di calcolo, con focus su chiarezza, professionalità e conversione dei visitatori.",
      "stack": "Stack: React | SASS | TypeScript | Boxicons"
    },
    {
      "title": "Piattaforma IDE",
      "description": "Piattaforma web sviluppata per centralizzare e semplificare la gestione dei progetti di evangelizzazione dell’IEADPE, con un’interfaccia chiara e accessibile.",
      "stack": "Stack: React | JavaScript | SASS | Boxicons"
    },
    {
      "title": "IDE API",
      "description": "API responsabile della logica di business e della persistenza dei dati della piattaforma IDE, basata su un’architettura organizzata e pattern di progettazione.",
      "stack": "Stack: NodeJs | Express | Postgres | Factory"
    },
    {
      "title": "Landing Page – Corso di Pianoforte",
      "description": "Landing page creata per promuovere corsi di pianoforte, con presentazione chiara dei contenuti, acquisizione di lead e ottimizzazione della conversione.",
      "stack": "Stack: React | TypeScript | SASS | Boxicons"
    },
    {
      "title": "Landing Page – Corso di React",
      "description": "Landing page sviluppata per promuovere corsi di React, evidenziando benefici, valore e call to action in modo moderno.",
      "stack": "Stack: React | TypeScript | SASS | Boxicons"
    },
    {
      "title": "Landing Page – Ebook di Ricette",
      "description": "Landing page focalizzata sulla promozione e vendita di ebook di ricette, con un’esperienza visiva curata e strategie di conversione.",
      "stack": "Stack: React | TypeScript | SASS | Boxicons"
    },
    {
      "title": "Landing Page – Mentorship",
      "description": "Landing page creata per presentare servizi di mentorship nel traffico a pagamento, con comunicazione diretta e struttura persuasiva.",
      "stack": "Stack: React | TypeScript | SASS | Boxicons"
    },
    {
      "title": "Landing Page – Dentista",
      "description": "Landing page sviluppata per promuovere servizi odontoiatrici, trasmettendo fiducia, professionalità e facilitando il contatto con i pazienti.",
      "stack": "Stack: React | TypeScript | SASS | Boxicons"
    }
  ],
    "textButton": "Vedi progetto"
  },
  "services": {
    "title": "Servizi",
    "card1": {
      "title": "Creazione di Siti Web",
      "text": "Creazione di siti web personalizzati, sia personali che per diversi settori commerciali."
    },
    "card2": {
      "title": "Siti Web Reattivi",
      "text": "Tutti i siti web sono reattivi, per migliorare ulteriormente l'esperienza dell'utente su qualsiasi dispositivo."
    },
    "card3": {
      "title": "Creazione di API",
      "text": "Creazione di API Rest sicure ed esperienza nell'integrazione con database esterni."
    }
  },
  "contact": {
    "title": "Contatto",
    "namePlaceholder": "Inserisci nome e cognome",
    "emailPlaceholder": "Inserisci la tua email",
    "subjectPlaceholder": "Oggetto del messaggio",
    "messagePlaceholder": "Il tuo messaggio...",
    "sendButton": "Invia"
  }
}