{
  "navigation": {
    "links": {
      "home": "home",
      "about": "sobre",
      "skills": "habilidades",
      "services": "serviços",
      "projects": "projetos",
      "contact": "contato"
    },
    "ariaLabels": {
      "changeLanguage": "Mudar idioma",
      "changeTheme": "Mudar tema",
      "toggleMenu": "Abrir e fechar menu"
    },
    "altTexts": {
      "languageIcon": "ícone do idioma",
      "themeIcon": "ícone do tema"
    }
  },
  "init": {},
  "about": {
    "title": "Sobre",
    "description1": "Meu nome é <strong className='strong-light'>Jefferson Santos</strong> e sou um entusiasta de tecnologia que decidiu seguir carreira em programação. Nos últimos <strong className='strong-light'>quatro anos</strong>, dediquei-me a compreender as principais tecnologias do mercado e a aplicar <strong className='strong-light'>metodologias ágeis de desenvolvimento</strong> (sou um amante de café).",
    "description2": "Concluí um curso técnico em <strong className='strong-light'> Desenvolvimento de Sistemas (DS)</strong> com foco em <strong className='strong-light'> desenvolvimento Full Stack</strong>. Desde então, tenho trabalhado em projetos como freelancer e contribuído para projetos de código aberto, aprimorando continuamente minhas habilidades e experiência na área."
  },
  "skills": {
    "title": "Habilidades",
    "defaultText": "* Passe o mouse sobre as habilidades para saber mais *",
    "textNodejs": "Escolhi o Node.js porque me permite criar aplicações escaláveis e rápidas, que aguentam muitas requisições ao mesmo tempo sem perder performance. Gosto de explorar o poder do JavaScript no backend e seus frameworks para desenvolver soluções modernas, sólidas e que realmente fazem diferença.",
    "textExpress": "O Express.js é o meu framework de escolha para criar APIs RESTful robustas e escaláveis, fornecendo uma estrutura flexível e modular para lidar com requisições e respostas de forma eficiente.",
    "textNestjs": "Estou apaixonado por aprender e dominar o Nest.js, um framework que promete revolucionar a forma como desenvolvo aplicações server-side robustas e escaláveis, com uma arquitetura modular e integração com TypeScript.",
    "textReact": "Com a poderosa biblioteca React, Desenvolvo interfaces dinâmicas e reativas, criando experiências de usuário fluídas e interativas com JavaScript e TypeScript, sempre priorizando a performance e a escalabilidade.",
    "textNextJs": "Com o Next.js, crio aplicações web server-side rendering (SSR) e static site generation (SSG) que são verdadeiramente excepcionais, garantindo velocidade, SEO e experiência de usuário impecáveis.",
    "textSass": "O Sass é a minha ferramenta de escolha para criar estilos CSS mais eficientes e modulares, aproveitando a capacidade de usar variáveis, mixins e funções para criar uma experiência de usuário personalizada e responsiva.",
    "textFlutter": "Atualmente, estudo e aplico Flutter no desenvolvimento de aplicações móveis multiplataforma, criando interfaces personalizadas e experiências de usuário fluídas e de alta qualidade.",
    "textJava": "Java é meu primeiro amor, com ele crio aplicações 'Topzadas' que atendam às necessidades mais complexas, aproveitando a capacidade de lidar com grandes volumes de dados e garantir a integridade e a disponibilidade dos dados.",
    "textPostgres": "Postgres é o meu banco de dados de escolha, e com o Neon, posso provisionar e gerenciar bancos de dados serverless de forma eficiente, garantindo a integridade e a disponibilidade dos dados.",
    "textMySQL": "Com o MySQL, armazeno e gerencio grandes volumes de dados de forma eficiente e escalável, garantindo a integridade e a disponibilidade dos dados.",
    "textGit": "Git e GitHub são as minhas ferramentas de escolha para gerenciar o versionamento de código e colaborar com outros desenvolvedores, garantindo a integridade e a rastreabilidade do código.",
    "textDocker": "Com o Docker, posso containerizar aplicações e garantir a consistência e portabilidade em diferentes ambientes, simplificando o processo de desenvolvimento, teste e implantação, e garantindo a escalabilidade e a confiabilidade."
  },
  "project": {
    "title": "Projetos",
    "list": [
      {
        "title": "Cardápio Online",
        "description": "Descrição do projeto Cardápio Online",
        "stack": "Stack: Vite | HTML | SASS | CSS | JavaScript | API ViaCep"
      },
      {
        "title": "Jéssica Planilhas",
        "description": "Descrição do projeto Jéssica Planilhas",
        "stack": "Stack: Vite | HTML | CSS | JavaScript | Bootstrap Icons"
      },
      {
        "title": "Loja de Sushi",
        "description": "Descrição do projeto Loja de Sushi",
        "stack": "Stack: Vite | HTML | CSS | SASS | JavaScript | autoprefixer"
      },
      {
        "title": "Lan House Infoccell",
        "description": "Descrição do projeto Lan House Infoccell",
        "stack": "Stack: Vite | HTML | CSS | SASS | JavaScript"
      },
      {
        "title": "Bolachas Léo de Lita",
        "description": "Descrição do projeto Bolachas Léo de Lita",
        "stack": "Stack: Vite | HTML | CSS | SASS | JavaScript"
      },
      {
        "title": "Calculadora de IMC",
        "description": "Descrição do projeto Calculadora de IMC",
        "stack": "Stack: HTML | CSS | JavaScript | SEO"
      },
      {
        "title": "Página de Venda de Plani",
        "description": "Descrição do projeto Página de Venda de Planilhas",
        "stack": "Stack: HTML | SASS | CSS | JavaScript | SEO"
      },
      {
        "title": "Promoção 3D",
        "description": "Descrição do projeto Promoção 3D",
        "stack": "Stack: HTML | SASS | CSS | JavaScript | SEO"
      },
      {
        "title": "Promoção 3D",
        "description": "Descrição do projeto Página Planner",
        "stack": "Stack: HTML | SASS | CSS | JavaScript | SEO"
      }
    ],
    "textButton": "Ver projeto"
  },
  "services": {
    "title": "Serviços",
    "card1": {
      "title": "Criação de Sites",
      "text": "Criação de sites personalizados, sejam pessoais ou para diversos setores de negócio"
    },
    "card2": {
      "title": "Sites Responsivos",
      "text": "Todos os sites são responsivos, para melhorar ainda mais a experiência do usuário em qualquer dispositivo."
    },
    "card3": {
      "title": "Criação de APIs",
      "text": "Criação de APIs Rest seguras e experiência de integração com bancos de dados externos."
    }
  },
  "contact": {
    "title": "Contato",
    "namePlaceholder": "Insira seu nome e sobrenome",
    "emailPlaceholder": "Insira seu email",
    "subjectPlaceholder": "Assunto da mensagem",
    "messagePlaceholder": "Sua mensagem...",
    "sendButton": "Enviar"
  }
}