{
  "navigation": {
    "links": {
      "home": "home",
      "about": "sobre",
      "skills": "habilidades",
      "services": "serviços",
      "projects": "projetos",
      "contact": "contato"
    },
    "ariaLabels": {
      "changeLanguage": "Mudar idioma",
      "changeTheme": "Mudar tema",
      "toggleMenu": "Abrir e fechar menu"
    },
    "altTexts": {
      "languageIcon": "ícone do idioma",
      "themeIcon": "ícone do tema"
    }
  },
  "init": {},
  "about": {
    "title": "Sobre",
    "description1": "Meu nome é <strong className='strong-light'>Jefferson Santos</strong> e sou um entusiasta de tecnologia que decidiu seguir carreira em programação. Nos últimos <strong className='strong-light'>quatro anos</strong>, dediquei-me a compreender as principais tecnologias do mercado e a aplicar <strong className='strong-light'>metodologias ágeis de desenvolvimento</strong> (sou um amante de café).",
    "description2": "Concluí um curso técnico em <strong className='strong-light'> Desenvolvimento de Sistemas (DS)</strong> com foco em <strong className='strong-light'> desenvolvimento Full Stack</strong>. Desde então, tenho trabalhado em projetos como freelancer e contribuído para projetos de código aberto, aprimorando continuamente minhas habilidades e experiência na área."
  },
  "skills": {
    "title": "Habilidades",
    "defaultText": "* Passe o mouse sobre as habilidades para saber mais *",
    "textNodejs": "Escolhi o Node.js porque me permite criar aplicações escaláveis e rápidas, que aguentam muitas requisições ao mesmo tempo sem perder performance. Gosto de explorar o poder do JavaScript no backend e seus frameworks para desenvolver soluções modernas, sólidas e que realmente fazem diferença.",
    "textExpress": "O Express.js é o meu framework de escolha para criar APIs RESTful robustas e escaláveis, fornecendo uma estrutura flexível e modular para lidar com requisições e respostas de forma eficiente.",
    "textNestjs": "Estou apaixonado por aprender e dominar o Nest.js, um framework que promete revolucionar a forma como desenvolvo aplicações server-side robustas e escaláveis, com uma arquitetura modular e integração com TypeScript.",
    "textReact": "Com a poderosa biblioteca React, Desenvolvo interfaces dinâmicas e reativas, criando experiências de usuário fluídas e interativas com JavaScript e TypeScript, sempre priorizando a performance e a escalabilidade.",
    "textNextJs": "Com o Next.js, crio aplicações web server-side rendering (SSR) e static site generation (SSG) que são verdadeiramente excepcionais, garantindo velocidade, SEO e experiência de usuário impecáveis.",
    "textSass": "O Sass é a minha ferramenta de escolha para criar estilos CSS mais eficientes e modulares, aproveitando a capacidade de usar variáveis, mixins e funções para criar uma experiência de usuário personalizada e responsiva.",
    "textFlutter": "Atualmente, estudo e aplico Flutter no desenvolvimento de aplicações móveis multiplataforma, criando interfaces personalizadas e experiências de usuário fluídas e de alta qualidade.",
    "textJava": "Java é meu primeiro amor, com ele crio aplicações 'Topzadas' que atendam às necessidades mais complexas, aproveitando a capacidade de lidar com grandes volumes de dados e garantir a integridade e a disponibilidade dos dados.",
    "textPostgres": "Postgres é o meu banco de dados de escolha, e com o Neon, posso provisionar e gerenciar bancos de dados serverless de forma eficiente, garantindo a integridade e a disponibilidade dos dados.",
    "textMySQL": "Com o MySQL, armazeno e gerencio grandes volumes de dados de forma eficiente e escalável, garantindo a integridade e a disponibilidade dos dados.",
    "textGit": "Git e GitHub são as minhas ferramentas de escolha para gerenciar o versionamento de código e colaborar com outros desenvolvedores, garantindo a integridade e a rastreabilidade do código.",
    "textDocker": "Com o Docker, posso containerizar aplicações e garantir a consistência e portabilidade em diferentes ambientes, simplificando o processo de desenvolvimento, teste e implantação, e garantindo a escalabilidade e a confiabilidade."
  },
  "project": {
    "title": "Projetos",
    "list": [
      {
        "title": "Plataforma JTec",
        "description": "Plataforma web focada em centralizar a gestão de projetos e equipes em um único ambiente. Permite acompanhar clientes, empresas, usuários, tarefas, metas e acessos ao sistema, oferecendo visão estratégica, controle operacional e segurança para a tomada de decisões.",
        "stack": "Stack: NextJs | ChartJs | JavaScript | SASS"
      },
      {
        "title": "JTec API",
        "description": "API responsável por sustentar toda a lógica de negócio da plataforma JTec. Gerencia autenticação, permissões, projetos, usuários, tarefas e registros de acesso, seguindo boas práticas de arquitetura, documentação e escalabilidade.",
        "stack": "Stack: NodeJs | Express | Postgres | Docker | Swagger"
      },
      {
        "title": "Bolachas Léo de Lita",
        "description": "Website institucional desenvolvido para apresentar os produtos da marca de forma atrativa, reforçar sua identidade visual e criar um canal digital de comunicação com clientes e parceiros.",
        "stack": "Stack: React | SASS | TypeScript | Boxicons"
      },
      {
        "title": "Óticas Leal",
        "description": "Site institucional criado para destacar produtos, serviços e a credibilidade da Óticas Leal, proporcionando uma navegação simples e alinhada à identidade da marca.",
        "stack": "Stack: React | SASS | JavaScript | Boxicons"
      },
      {
        "title": "Jéssica Planilhas",
        "description": "Website voltado à apresentação de soluções em planilhas personalizadas, com foco em clareza, profissionalismo e conversão de visitantes em potenciais clientes.",
        "stack": "Stack: React | SASS | TypeScript | Boxicons"
      },
      {
        "title": "Plataforma IDE",
        "description": "Plataforma web desenvolvida para centralizar e facilitar a gestão de projetos de evangelização da IEADPE. A interface foi pensada para oferecer uma navegação simples, organizada e acessível, apoiando a comunicação e o acompanhamento das ações da igreja.",
        "stack": "Stack: React | JavaScript | SASS | Boxicons"
      },
      {
        "title": "IDE API",
        "description": "API responsável pela lógica de negócio e persistência de dados da Plataforma IDE. Implementa regras, integrações e controle das informações, utilizando uma arquitetura organizada e padrões de projeto para garantir escalabilidade e manutenção a longo prazo.",
        "stack": "Stack: NodeJs | Express | Postgres | Factory"
      },
      {
        "title": "Loading Page - Curso de Piano",
        "description": "Landing page criada para divulgar cursos de piano, com foco em apresentação clara do conteúdo, captação de leads e incentivo à conversão dos visitantes.",
        "stack": "Stack: React | TypeScript | SASS | Boxicons"
      },
      {
        "title": "Loading Page - Curso de React",
        "description": "Landing page desenvolvida para promover cursos de React, destacando benefícios, proposta de valor e chamada para ação de forma objetiva e moderna.",
        "stack": "Stack: React | TypeScript | SASS | Boxicons"
      },
      {
        "title": "Loading Page - Ebook de Receitas",
        "description": "Landing page focada na divulgação e venda de ebooks de receitas, priorizando uma experiência visual agradável e estratégias de conversão.",
        "stack": "Stack: React | TypeScript | SASS | Boxicons"
      },
      {
        "title": "Loading Page - Mentoria",
        "description": "Landing page criada para apresentar serviços de mentoria em tráfego pago, com comunicação direta, estrutura persuasiva e foco na geração de contatos.",
        "stack": "Stack: React | TypeScript | SASS | Boxicons"
      },
      {
        "title": "Loading Page - Dentista",
        "description": "Landing page desenvolvida para divulgação de serviços odontológicos, transmitindo confiança, profissionalismo e facilitando o contato com pacientes.",
        "stack": "Stack: React | TypeScript | SASS | Boxicons"
      },
      {
        "title": "Loja de Sushi",
        "description": "Website institucional desenvolvido para divulgar produtos de sushi, com foco em apresentação clara e captação de leads.",
        "stack": "Stack: React | TypeScript | SASS | Boxicons"
      },
      {
        "title": "Portifólio Pessonal",
        "description": "Meu portifólio pessoal, onde apresento projetos, experiências e habilidades desenvolvidas ao longo da carreira de desenvolvedor web.",
        "stack": "Stack: React | TypeScript | SASS | Boxicons"
      }
    ],
    "textButton": "Ver projeto"
  },
  "services": {
    "title": "Serviços",
    "card1": {
      "title": "Criação de Sites",
      "text": "Criação de sites personalizados, sejam pessoais ou para diversos setores de negócio"
    },
    "card2": {
      "title": "Sites Responsivos",
      "text": "Todos os sites são responsivos, para melhorar ainda mais a experiência do usuário em qualquer dispositivo."
    },
    "card3": {
      "title": "Criação de APIs",
      "text": "Criação de APIs Rest seguras e experiência de integração com bancos de dados externos."
    }
  },
  "contact": {
    "title": "Contato",
    "namePlaceholder": "Insira seu nome e sobrenome",
    "emailPlaceholder": "Insira seu email",
    "subjectPlaceholder": "Assunto da mensagem",
    "messagePlaceholder": "Sua mensagem...",
    "sendButton": "Enviar"
  },
  "messages": {
    "here":"É aqui mesmo! 😎",
    "repositoryNot": "Esse repositório não tá disponível (por enquanto)!",
    "deployNot": "Esse deploy não tá disponível (por enquanto)!",
    "see_in": "Veja em:",
    "tech": "Stack:",
    "lib": "Libs:",
    "infra": "Infra:"
  }
}